{
  "data": [
    {
      "id": 0,
      "title": "Показник заломлення",
      "body": "\tПоказник заломлення — це величина, яка характеризує заломлюючу силу прозорого середовища. Чим вищий показник заломлення, тим тоншою є лінз"
    },
    {
      "id": 1,
      "title": "Сфера",
      "body": "\tСфера - це оптична сила лінзи, вимірюється в діоптріях, позначається D чи Дптр., застосовується для корекції аномалії рефракції. Для далекозорості (міопії) використовують розсіювальні лінзи — перед числовим значенням стоїть знак «-». Для далекозорості (гіперметропії) використовують збираючі лінзи — перед числовим значенням стоїть знак «+»"
    },
    {
      "id": 2,
      "title": "Циліндр",
      "body": "\tЦиліндр - оптична сила лінзи, яка застосовується для корекції астигматизму. У здоровому вигляді рогівка і кришталик мають сферичну форму. Якщо ця форма змінюється, то при проходженні світлових променів крізь рогівку утворюється викривлене зображення предмета. Одні фрагменти зображення фокусуються на сітківці, інші — перед нею, або поза нею. У результаті цього людина бачить картинку, в якій присутні як чіткі, так і розмиті ділянки і лінії. Астигматизм може бути двох видів:\n\t— рогівковий\n\t— кришталиковий\n\tТакож астигматизм може бути як вродженим, так і набутим. При астигматизмі у рецепті обов\"язково вказується положення осі циліндра в градусах — від 1° до 180° (він же 0°). Це пов\"язано з відмінностями заломлення світла, яке проходить крізь циліндричну лінзу:\n\t— промені, які проходять перпендикулярно осі циліндра переломлюються\n\t— промені, які проходять паралельно осі, не змінюють напрямок руху\n\tТакі властивості дозволяють «виправити» переломлення світла у потрібному меридіані. Значення циліндра буває мінусовим і плюсовим (див. Транспозиція)"
    },
    {
      "id": 3,
      "title": "Кут осі циліндра",
      "body": "\tВказує, під яким кутом розташована вісь циліндра. Положення осі вимірюється у градусах від 1° до 180° (він же 0°)"
    },
    {
      "id": 4,
      "title": "Кривизна передньої поверхні",
      "body": "\tПередня поверхня лінзи вимірюється сферометром, отримане значення по формулі перераховується в кривизну, виражену в міліметрах або в діоптріях (в цьому додатку). Значення у межах від 0.001 (плоска передня поверхня) для виготовлення лінз з великим негативним значенням (\"мінусових\" лінз),  до 10.5 (приблизне значення), для виготовлення лінз з великим позитивним значенням (\"плюсових\" лінз)"
    },
    {
      "id": 5,
      "title": "Товщина лінзи по центру",
      "body": "\tТовщина лінзи в її оптичному центрі. Для \"плюсових\" лінз найбільша товщина буде в оптичному центрі, а для \"мінусових\" навпаки: найменша товщина буде у оптичному центрі лінзи. Товщина вимірюється товщинометром"
    },
    {
      "id": 6,
      "title": "Товщина лінзи по краю",
      "body": "\tДля \"плюсових\" лінз мінімальна товщина буде по краю, а для \"мінусових\", відповідно, мінімальна товщина буде по центру, а максимальна – по краю. Слід зауважити, що для оправ \"на жилці\" та \"на гвинтах\" (для \"плюсових\" лінз), товщина по краю буде в середньому на 1.5 мм більша ніж в ободкових (рамочних) оправах. Це пов\"язано з тим, що для нарізання канавки для жилки необхідно близько 2 мм (для металевої жилки 2.5 – 3.0 мм), для оправ \"на гвинтах\" необхідні ті ж 2 мм \"тіла\" лінзи для того, щоб лінза не ламалася при найменших навантаженнях. Для оправ \"на гвинтах\" найкраще всього застосовувати полікарбонат, або ж високоіндексні матеріали (1.61, 1.67, 1.74), оскільки вони міцніші порівняно з низькоіндексними. Також необхідно враховувати, що у астигматичних лінз із знаком циліндра «-» максимальна товщина буде під кутом 90°, а для лінз із знаком циліндра «+» — під кутом 0°, він же 180° (див. Транспозиція).\n\tP.S. Якщо одним із головних критеріїв при підборі окулярів є товщина лінз, то слід вибирати невелику ободкову оправу та високий показник заломлення лінзи"
    },
    {
      "id": 7,
      "title": "Діаметр лінзи",
      "body": "\tДіаметр лінзи в міліметрах. Чим більший діаметр — тим більша товщина лінзи. Розрахувати необхідний діаметр можна в меню «ДІАМЕТР»"
    },
    {
      "id": 8,
      "title": "Ефективний діаметр",
      "body": "\tЕфективний діаметр окуляра (Effective diameter) —  це відстань в міліметрах між двома найвіддаленішими точками окуляра (найбільша діагональ). Здебільшого, для коригуючих оправ, це значення перевищує горизонтальний розмір (А) на 2 – 3 мм"
    },
    {
      "id": 9,
      "title": "Відстань між лінзами",
      "body": "\tВідстань між лінзами (Distance between lenses) — це відстань в міліметрах між лінзами (перенісся)"
    },
    {
      "id": 10,
      "title": "Відстань між зіницями",
      "body": "\tВідстань між зіницями, міжцентрова відстань (Pupil distance) — це відстань між зіницями в міліметрах"
    },
    {
      "id": 11,
      "title": "Транспозиція",
      "body": "\tОптометристи можуть ставити значення циліндра як «+», так і «-». Це обумовлено тим, що інструменти багато років тому вимірювали аномалію рефракції ока тільки у \"плюсовому\" циліндрі, та виготовлялись астигматичні лінзи теж тільки у циліндрі із знаком «+». Зараз, головним чином, рецепти виписують у \"мінусовому\" циліндрі. Перераховується \"плюсовий\" циліндр у \"мінусовий\" (і навпаки) наступним чином: значення циліндра добавляється до значення cфери, та до поточного значення кута додається 90°.\n\tПриклади:\n\tsph -7.0 cyl -3.0 axis 22° можна записати як:\n\tsph -10.0 cyl +3.0 axis 112°\n\tsph +5.75 cyl -1.25 axis 165° можна записати як:\n\tsph +4.5 cyl +1.25 axis 75°"
    }
  ]
}